#include <stdio.h>
#include <locale.h>

int question1() {

	printf("123\n"); // подзадание 1

	printf("1\n2\n3\n"); // подзадание 2

	printf("1\n\t2\n\t\t3\n"); // подзадание 3

	printf("%d\n\t%d\n\t\t%d\n\t\t\t%d\n", 1, 2, 3, 4); // подзадание 4

	printf("%10.3f\n ", 12.234657); // подзадание 5

	printf("%10.5f\n ", 12.234657); // подзадание 6

	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); // подзадание 7

	printf("Деление %d на %d равно %f\n ", 7, 5, 7 / 5); // подзадание 8

	printf("Умножение %d на %d равно %f\n ", 2000, 4, 2000 * 4); // подзадание 9

	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 10

	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); // первые два значения преобразуются в 0, а результат деления примет значение наименьшего int

	printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); // первые два значения приобретут нули после запятой, тк они стали вещественными, результат станет корректным

	printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000); // значения выведутся в таком виде, в котором они будут занимать меньше символов

	printf("%e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000); // все значения выведутся в экспоненциальном представлении

	return 0;
}

int question2() {

	int n = 12; // подзадание 1
	int k = 0;

	printf("Сейчас %d часов %02d минут 00 секунд\n", n, k); // подзадание 2.1

	printf("Идет %d минута суток\n", n*60); // подзадание 2.2

	printf("До полуночи осталось %d часов и %d минут\n", (24*60 - n*60 - k) / 60, (24 * 60 - n * 60 + k) % 60); // подзадание 2.3

	printf("С 8.00 прошло %d секунд\n", (n - 8)*3600 + k*60); // подзадание 2.4

	printf("Текущий час  = %4.2f суток  и текущая минута =  %4.2f часа\n", n / 24., k / 60.); // подзадание 2.5

	return 0;
}

int question3() {

	float L = 353.;
	int n = 2;
	int k = 2;
	int m = 4;

	printf(
		"Дано:\n"
		"\t%8.0f\n"
		"\t%8.0f\n"
		"\t________\n"
		"Ответ:\n"
		"\t%+0*.*f\n",
		n, L, k+2+m, m, n / L
	);
}
int main() {

	setlocale(LC_ALL, ".UTF-8"); // кодировка

	question1();
	question2();
	question3();

	return 0;
}