#include <stdio.h>
#include <locale.h>

int findProductivity() {

	// Инициализация переменных

	float t1 = 12.; 
	float t2 = 15.;
	int unitProduction = 1;

	// Нахождение скорости работы каждой бригады (n-ная часть дома в день)

	float v1 = unitProduction / t1;
	float v2 = unitProduction / t2;

	// Нахождение скорости работы двух бригад вместе

	float v12 = v1 + v2;

	// Нахождение количества дней, требуемого для строительства 1-го дома двумя бригадами

	float quantityDays = unitProduction / v12;

	// Вывод результата

	printf("Количество дней, нужное для строительства 1-го дома первой бригадой: %.0f\n"
		"Количество дней, нужное для строительства 1-го дома второй бригадой: %0.f\n"
		"Скорость строительства первой бригады: %.2f дома в день\n"
		"Скорость строительства второй бригады: %.2f дома в день\n"
		"Общая скорость строительства: %.2f дома в день\n"
		"Количество дней, требуемое для строительства 1-го дома двумя бригадами: %.2f", 
		t1, t2, v1, v2, v12, quantityDays);

	return 0;
}

int main() {

	setlocale(LC_ALL, ".UTF-8"); // кодировка

	findProductivity(); 

	return 0;
}